
//stdio.h 是一个头文件 (标准输入输出头文件) , #include 是一个预处理命令，用来引入头文件。
#include <stdio.h>

//1.1.1.1 C语言发展历史
void test_1_1_1_1();
//1.1.1.2 C语言的特点
void test_1_1_1_2();
//1.1.1.3 C语言版本介绍
void test_1_1_1_3();

int main() {
    test_1_1_1_1();
    test_1_1_1_2();
    test_1_1_1_3();
}


void test_1_1_1_1() {
    //C 语言最初是作为 Unix 系统的开发工具而发明的。 
    //1969年，美国贝尔实验室的肯·汤普森（Ken Thompson）与丹尼斯·里奇（Dennis Ritchie）一起开发了 Unix 操作系统。Unix 是用汇编语言写的，无法移植到其他计算机，他们决定使用高级语言重写。但是，当时的高级语言无法满足他们的要求，汤普森就在 BCPL 语言的基础上发明了 B 语言。 
    //1972年，丹尼斯·里奇和布莱恩·柯林汉（Brian Kernighan）又在 B 语言的基础上重新设计了一种新语言，这种新语言取代了 B 语言，所以称为 C 语言。 
    //1973年，整个 Unix 系统都使用 C 语言重写。此后，这种语言开始快速流传，广泛用于各种操作系统和系统软件的开发。 
    //1988年，美国国家标准协会（ANSI）正式将 C 语言标准化，标志着 C 语言开始稳定和规范化。 
    //几十年后的今天，C 语言依然是最广泛使用、最流行的系统编程语言之一，Unix 和 Linux 系统现在还是使用 C 语言开发。
}


//1.1.1.2 C语言的特点
void test_1_1_1_2() {
    //C语言是一种通用的、高级的编程语言，具有以下特点：
    //
    //简洁而高效：C语言的语法相对简洁，具有清晰的结构和直观的表达方式。它提供了丰富的基本数据类型和操作符，使得程序员可以高效地编写代码。
    //
    //低级别的编程：C语言提供了对计算机底层的直接访问，允许程序员进行底层的内存操作和位级操作。这使得C语言非常适合编写系统级的软件和嵌入式系统。
    //
    //可移植性：C语言的标准库和语法规范相对稳定，使得C语言程序在不同的平台上具有较高的可移植性。C语言的编译器和解释器广泛存在于各种操作系统和硬件平台上。
    //
    //高性能：C语言的编译器能够生成高效的机器代码，使得C语言程序在执行速度和内存利用方面具有较高的性能。
    //
    //直接内存访问：C语言允许直接访问内存，使得程序员可以更精确地控制内存的分配和释放。这对于编写高效的数据结构和算法非常有用。
    //
    //支持面向过程和结构化编程：C语言支持面向过程的编程范式，使得程序员可以按照模块化和结构化的方式组织代码。这有助于提高代码的可读性和可维护性。
    //
    //丰富的库支持：C语言提供了丰富的标准库，包括输入输出、字符串处理、数学计算等功能。此外，还有许多第三方库可供使用，扩展了C语言的功能和应用领域。
    //
    //可与汇编语言和其他语言交互：C语言可以与汇编语言和其他高级语言（如C++、Python等）进行交互。这使得C语言在系统级编程、嵌入式开发和跨语言开发方面非常有用。
}


//1.1.1.3 C语言版本介绍
void test_1_1_1_3() {

}